#include <stdio.h>

int main() {
    // 초 (검정 배경 + 파란/초록 글씨)
    printf("\033[40;34m                       o      "); // 검정배경+파란색
    printf("\033[40;32mo\n");                                  // 검정배경+초록색
    printf("\033[40;34m                       |      "); // 검정배경+파란색
    printf("\033[40;32m|\n");                                  // 검정배경+초록색

    // 촛불 줄 (검정 배경 + 노란 글씨)
    printf("  ""\033[40;33m------------------------------------------------\n");

    // 배경 마젠타, 글씨 흰색
    printf("  ""\033[45;97m|＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼|\n");

    // 배경 흰색, 글씨 기본 검정

    printf("  ""\033[47;30m|                                               |\n");

    // 검정 배경, 흰색 글씨

    printf("  ""\033[40;97m------------------------------------------------\n");


    printf("------------------------------------------------------\n");

    // 배경 마젠타, 글씨 흰색
    printf("\033[45;97m|＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼/＼|\n");

    // 배경 흰색, 글씨 기본 검정
    printf("\033[47;30m|                                                     |\n");

    // 검정 배경, 흰색 글씨
    printf("\033[40;97m------------------------------------------------------\n");

    // 색상 리셋
    printf("\033[0m");

    return 0;
}

